app/Controllers/AdminController.php

    public function create() {
        $depModel = new \App\Models\DepartementModel();
        $data['departements'] = $depModel->findAll();
---
SELECT *
FROM `departements`

    public function save() {
        $model = new \App\Models\EmployeModel(); // Vérifie bien que c'est l'EmployeModel ici

        $data = [
            'nom'            => $this->request->getPost('nom'),
            'prenom'         => $this->request->getPost('prenom'),
            'email'          => $this->request->getPost('email'),
            'password'       => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'           => $this->request->getPost('role'),
            'departement_id' => $this->request->getPost('departement_id'),
            'date_embauche'  => $this->request->getPost('date_embauche'),
            'actif'          => 1
        ];

        $model->insert($data);
---
INSERT INTO `employes` (`nom`, `prenom`, `email`, `password`, `role`, `departement_id`, `date_embauche`, `actif`) VALUES ('qsdf', 'azer', 'azer@techmada.mg', '$2y$10$7V/kqnXzJfriYIKPC/FL8.8JB1DG6QfG3Xb7.s.L8l4zIlKPpupOS', 'employe', '2', '2026-05-13', 1)