app/Controllers/AuthController.php

SELECT *
FROM `employes`
WHERE `email` = 'admin@techmada.mg'
 LIMIT 1
---
    public function attemptLogin() {
        $session = session();
        $model = new \App\Models\EmployeModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();