app/Models/EmployeModel.php

    public function getEmployesWithDept() {
        return $this->select('employes.*, departements.nom as nom_departement') // 'nom' est le champ dans ta migration
                    ->join('departements', 'departements.id = employes.departement_id') // 'id' et 'departement_id'
                    ->findAll();
---
SELECT `employes`.*, `departements`.`nom` as `nom_departement`
FROM `employes`
JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`